-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 14 2023 г., 18:48
-- Версия сервера: 8.0.30
-- Версия PHP: 8.1.9

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `enot`
--
CREATE DATABASE IF NOT EXISTS `enot` DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci;
USE `enot`;

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE `users` (
  `id` int NOT NULL,
  `username` varchar(64) COLLATE utf8mb4_general_ci NOT NULL,
  `email` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `password` varchar(255) COLLATE utf8mb4_general_ci NOT NULL,
  `role` enum('user','admin') COLLATE utf8mb4_general_ci NOT NULL DEFAULT 'user',
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `username`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES
(1, 'avavion', 'avavionmvm@gmail.com', '$2y$10$XNXNSwhgP9LmR.SQwnqkG.RwOopaaOCChGNE18JAWsiUM4PAEbhbS', 'user', '2023-05-14 10:09:34', '2023-05-14 10:09:34'),
(2, 'parser', 'parser@enot.ru', '$2y$10$haW2brUGYxha49tVNv5.aOwkWDRGWEfR0IsoqH5QL/PoM5hImyfcK', 'admin', '2023-05-14 10:11:54', '2023-05-14 15:27:20');

-- --------------------------------------------------------

--
-- Структура таблицы `valutes`
--

CREATE TABLE `valutes` (
  `id` int NOT NULL,
  `name` varchar(128) COLLATE utf8mb4_general_ci NOT NULL,
  `char_code` varchar(4) COLLATE utf8mb4_general_ci NOT NULL,
  `value` float DEFAULT NULL,
  `updated_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
  `created_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Дамп данных таблицы `valutes`
--

INSERT INTO `valutes` (`id`, `name`, `char_code`, `value`, `updated_at`, `created_at`) VALUES
(1, 'Австралийский доллар', 'AUD', 51.6495, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(2, 'Азербайджанский манат', 'AZN', 45.4142, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(3, 'Фунт стерлингов Соединенного королевства', 'GBP', 96.6827, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(4, 'Армянских драмов', 'AMD', 19.9814, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(5, 'Белорусский рубль', 'BYN', 27.22, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(6, 'Болгарский лев', 'BGN', 43.1452, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(7, 'Бразильский реал', 'BRL', 15.5362, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(8, 'Венгерских форинтов', 'HUF', 22.6764, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(9, 'Вьетнамских донгов', 'VND', 32.6582, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(10, 'Гонконгских долларов', 'HKD', 98.6256, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(11, 'Грузинский лари', 'GEL', 30.3261, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(12, 'Датская крона', 'DKK', 11.3292, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(13, 'Дирхам ОАЭ', 'AED', 21.0239, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(14, 'Доллар США', 'USD', 77.2041, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(15, 'Евро', 'EUR', 84.25, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(16, 'Египетских фунтов', 'EGP', 24.9855, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(17, 'Индийских рупий', 'INR', 94.4563, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(18, 'Индонезийских рупий', 'IDR', 52.4413, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(19, 'Казахстанских тенге', 'KZT', 17.3797, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(20, 'Канадский доллар', 'CAD', 57.2858, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(21, 'Катарский риал', 'QAR', 21.2099, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(22, 'Киргизских сомов', 'KGS', 88.4354, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(23, 'Китайский юань', 'CNY', 11.0844, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(24, 'Молдавских леев', 'MDL', 43.3641, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(25, 'Новозеландский доллар', 'NZD', 48.4842, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(26, 'Норвежских крон', 'NOK', 72.2777, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(27, 'Польский злотый', 'PLN', 18.5484, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(28, 'Румынский лей', 'RON', 17.0707, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(29, 'СДР (специальные права заимствования)', 'XDR', 103.962, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(30, 'Сингапурский доллар', 'SGD', 57.9784, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(31, 'Таджикских сомони', 'TJS', 70.7425, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(32, 'Таиландских батов', 'THB', 22.7901, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(33, 'Турецких лир', 'TRY', 39.4775, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(34, 'Новый туркменский манат', 'TMT', 22.0583, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(35, 'Узбекских сумов', 'UZS', 67.3389, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(36, 'Украинских гривен', 'UAH', 20.9043, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(37, 'Чешских крон', 'CZK', 35.9239, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(38, 'Шведских крон', 'SEK', 74.8915, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(39, 'Швейцарский франк', 'CHF', 86.5614, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(40, 'Сербских динаров', 'RSD', 71.9023, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(41, 'Южноафриканских рэндов', 'ZAR', 39.8438, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(42, 'Вон Республики Корея', 'KRW', 57.8525, '2023-05-14 10:40:24', '2023-05-14 10:40:24'),
(43, 'Японских иен', 'JPY', 57.3795, '2023-05-14 10:40:24', '2023-05-14 10:40:24');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `valutes`
--
ALTER TABLE `valutes`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `users`
--
ALTER TABLE `users`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `valutes`
--
ALTER TABLE `valutes`
  MODIFY `id` int NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=44;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
